# Rebar Bend Data Crank Angled Length 0 Property

Source: https://www.revitapidocs.com/2026/06409240-9574-272c-9864-f19b4618d0f7.htm

---

| Rebar Bend Data Crank Angled Length 0 Property |
| --- |

Identifies the crank angled length at the start.

The default value is 0\. A positive value means that there is a valid crank. If the value is 0 it means that there is no crank. If the value is negative it means that there is a crank with incorrect values.

**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double CrankAngledLength0 { get; }
```

```
Public ReadOnly Property CrankAngledLength0 As Double
	Get
```

```
public:
property double CrankAngledLength0 {
	double get ();
}
```

```
member CrankAngledLength0 : float with get
```

#### Property Value

Double See Also

#### Reference

RebarBendData Class Autodesk.Revit.DB.Structure Namespace